<?php

namespace Database\Seeders;

use App\Models\User;
// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        



        // Insert default values into administrative_areas table
        DB::table('administrative_areas')->insert([
            ['name' => 'الباحة'],
            ['name' => 'الجوف'],
            ['name' => 'الحدود الشمالية'],
            ['name' => 'الرياض'],
            ['name' => 'الشرقية'],
            ['name' => 'القصيم'],
            ['name' => 'المدينة المنورة'],
            ['name' => 'تبوك'],
            ['name' => 'جازان'],
            ['name' => 'حائل'],
            ['name' => 'عسير'],
            ['name' => 'مكة المكرمة'],
            ['name' => 'نجران'],
        ]);

        // Insert default values into report_types table
        DB::table('report_types')->insert([
            ['name' => 'achievement', 'state' => true],
            ['name' => 'maintenance', 'state' => true],
            ['name' => 'financial', 'state' => true],
        ]);

        // Insert default values into resources table
        DB::table('resources')->insert([
            ['name' => 'بشرية فقط'],
            ['name' => 'مادية فقط'],
            ['name' => 'بشرية ومادية'],
            ['name' => 'لا يوجد'],
        ]);

        // Insert default values into performance_indicators table
        DB::table('performance_indicators')->insert([
            ['name' => 'نسبة المدربين المستفيدين من الدورات التدريبية'],
            ['name' => 'نسبة المدرب للمتدرب'],
            ['name' => 'تكلفة المتدرب السنوية (ريال سعودي)'],
            ['name' => 'معدل التخرج حسب الدفعه (%)'],
            ['name' => 'معدل التوظيف خلال 6 شهور من التخرج (%)'],
            ['name' => 'عدد الخريجين (#)'],
            ['name' => 'عدد مذكرات التفاهم والشراكات (#)'],
            ['name' => 'معدل التسرب للمتدربين (%)'],
            ['name' => 'معدل التعثر'],
            ['name' => 'متوسط المعدل التراكمي GPA لمتدربي المنشأة التدريبية'],
            ['name' => 'عدد المتدربين المشاركين في الأعمال التطوعيه والبرامج والفعاليات'],
            ['name' => 'معدل رضا المدربين'],
            ['name' => 'معدل الرضا الكلي للمتدربين'],
            ['name' => 'معدل الرضا الكلي لأصحاب العمل'],
            ['name' => 'نسبة توفر الخدمات للمتدربين (%)'],
            ['name' => 'عدد المبتكرين والأفكار الإبداعية المطروحة من المنسوبين'],
            ['name' => 'معدل «قياس» لمتدربي المنشأة التدريبية (درجة)'],
            ['name' => 'نسبة المتدربين من خريجي الثانوية العامة من المنطقة (%)'],
            ['name' => 'عدد المقبولين'],
            ['name' => 'معدل تطبيق معايير الأمن والسلامة بالمنشأة التدريبية (%)'],
            ['name' => 'نسبة اشغال المقاعد التدريبية'],
            ['name' => 'نسبة المقبولين للمتقدمين'],
            ['name' => 'معدل اشغال المرافق'],
            ['name' => 'متوسط النصاب التدريبي'],
        ]);

        // Insert default values into maintenance_types table
        DB::table('maintenance_types')->insert([
            ['name' => 'صيانة دورية'],
            ['name' => 'صيانة وقائية'],
            ['name' => 'صيانة طارئة'],
        ]);

        // Insert default values into request_types table
        DB::table('request_types')->insert([
            ['name' => 'إضاءة'],
            ['name' => 'تكييف'],
            ['name' => 'دهان'],
            ['name' => 'سباكة'],
            ['name' => 'كهرباء'],
            ['name' => 'مصعد'],
            ['name' => 'صيانة أجهزة حاسب آلي'],
            ['name' => 'صيانة أجهزة عرض'],
            ['name' => 'صيانة معمل'],
        ]);

        // Insert default values into departments table
        DB::table('departments')->insert([
            ['name' => 'إدارة الخدمات المساندة'],
            ['name' => 'وحدة الخدمات العامة'],
            ['name' => 'وحدة السلامة والصحة المهنية'],
            ['name' => 'وحدة تقنية المعلومات'],
        ]);
        DB::table('departments')->insert([
            ['name' => 'الكلية التقنية بجدة'],
       ['name' => 'غير ذلك'],
        ]);

        DB::table('training_classes')->insert([
            ['name' => 'إدارة الخدمات المساندة'],
            ['name' => 'وحدة الخدمات العامة'],
            ['name' => 'وحدة السلامة والصحة المهنية'],
            ['name' => 'وحدة تقنية المعلومات'],
        ]);
        // Insert default values into establishments table and  maintenance_requesting_agencies and executing_agencies
        DB::table('establishments')->insert([
            ['name' => 'عمادة الكلية'],
            ['name' => 'وكالة الكلية للجودة'],
            ['name' => 'وكالة الكلية لشؤون المتدربين'],
            ['name' => 'وكالة الكلية لشؤون المدربين'],
            ['name' => 'قسم تقنية الاعمال'],
            ['name' => 'قسم تقنية السياحة والضيافة'],
            ['name' => 'قسم التقنية المدنية والمعمارية'],
            ['name' => 'قسم التقنية الكهربائية'],
            ['name' => 'قسم التقنية الميكانيكية'],
            ['name' => 'قسم تقنية البيئة'],
            ['name' => 'قسم الدراسات العامة'],
            ['name' => 'قسم التنسيق الوظيفي'],
            ['name' => 'قسم القبول والتسجيل'],
            ['name' => 'قسم التدرب الإلكتروني'],
            ['name' => 'وحدة الإتصال المؤسسي'],
            ['name' => 'وحدة التدريب التعاوني'],
            ['name' => 'وحدة التوجيه والإرشاد'],
            ['name' => 'وحدة تقنية المعلومات'],
            ['name' => 'وحدة صندوق المتدربين'],
            ['name' => 'وحدة السلامة والصحة المهنية'],
            ['name' => 'وحدة النشاط'],
            ['name' => 'مركز الموهبة والابتكار'],
            ['name' => 'مركز الأعمال وخدمة المجتمع'],
            ['name' => 'العيادة الطبية'],
            ['name' => 'المستودع'],
            ['name' => 'مطعم الكلية'],
            ['name' => 'مكتبة الكلية'],
            ['name' => 'القرطاسية'],
        ]);




        DB::table('executing_agencies')->insert([
            ['name' => 'عمادة الكلية'],
            ['name' => 'وكالة الكلية للجودة'],
            ['name' => 'وكالة الكلية لشؤون المتدربين'],
            ['name' => 'وكالة الكلية لشؤون المدربين'],
            ['name' => 'قسم تقنية الاعمال'],
            ['name' => 'قسم تقنية السياحة والضيافة'],
            ['name' => 'قسم التقنية المدنية والمعمارية'],
            ['name' => 'قسم التقنية الكهربائية'],
            ['name' => 'قسم التقنية الميكانيكية'],
            ['name' => 'قسم تقنية البيئة'],
            ['name' => 'قسم الدراسات العامة'],
            ['name' => 'قسم التنسيق الوظيفي'],
            ['name' => 'قسم القبول والتسجيل'],
            ['name' => 'قسم التدرب الإلكتروني'],
            ['name' => 'وحدة الإتصال المؤسسي'],
            ['name' => 'وحدة التدريب التعاوني'],
            ['name' => 'وحدة التوجيه والإرشاد'],
            ['name' => 'وحدة تقنية المعلومات'],
            ['name' => 'وحدة صندوق المتدربين'],
            ['name' => 'وحدة السلامة والصحة المهنية'],
            ['name' => 'وحدة النشاط'],
            ['name' => 'مركز الموهبة والابتكار'],
            ['name' => 'مركز الأعمال وخدمة المجتمع'],
            ['name' => 'إدارة الخدمات المساندة'],
            ['name' => 'العيادة الطبية'],
            ['name' => 'المستودع'],
            ['name' => 'مطعم الكلية'],
            ['name' => 'مكتبة الكلية'],
            ['name' => 'القرطاسية'],
        ]);


        DB::table('maintenance_requesting_agencies')->insert([
            ['name' => 'عمادة الكلية'],
            ['name' => 'وكالة الكلية للجودة'],
            ['name' => 'وكالة الكلية لشؤون المتدربين'],
            ['name' => 'وكالة الكلية لشؤون المدربين'],
            ['name' => 'قسم تقنية الاعمال'],
            ['name' => 'قسم تقنية السياحة والضيافة'],
            ['name' => 'قسم التقنية المدنية والمعمارية'],
            ['name' => 'قسم التقنية الكهربائية'],
            ['name' => 'قسم التقنية الميكانيكية'],
            ['name' => 'قسم تقنية البيئة'],
            ['name' => 'قسم الدراسات العامة'],
            ['name' => 'قسم التنسيق الوظيفي'],
            ['name' => 'قسم القبول والتسجيل'],
            ['name' => 'قسم التدرب الإلكتروني'],
            ['name' => 'وحدة الإتصال المؤسسي'],
            ['name' => 'وحدة التدريب التعاوني'],
            ['name' => 'وحدة التوجيه والإرشاد'],
            ['name' => 'وحدة تقنية المعلومات'],
            ['name' => 'وحدة صندوق المتدربين'],
            ['name' => 'وحدة السلامة والصحة المهنية'],
            ['name' => 'وحدة النشاط'],
            ['name' => 'مركز الموهبة والابتكار'],
            ['name' => 'مركز الأعمال وخدمة المجتمع'],
            ['name' => 'إدارة الخدمات المساندة'],
            ['name' => 'العيادة الطبية'],
            ['name' => 'المستودع'],
            ['name' => 'مطعم الكلية'],
            ['name' => 'مكتبة الكلية'],
            ['name' => 'القرطاسية'],
        ]);
    }
}
